{
  "backend/main.mo": "Empty Motoko actor indicating no backend logic is implemented.",
  "feature_evidence.json": "Feature evidence report listing build-script and documentation updates tied to Android AAB improvements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend and Android-wrapper file.",
  "frontend/android-wrapper/.gitignore": "Git ignore rules excluding build outputs, signing files, and generated Bubblewrap artifacts.",
  "frontend/android-wrapper/bubblewrap.config.json": "Bubblewrap configuration defining app identity, URLs, icons, signing key info, and Android build settings.",
  "frontend/android-wrapper/keystore.example.properties": "Template showing required keystore signing fields users must copy and fill for release builds.",
  "frontend/android-wrapper/README.md": "Guide for configuring and building the Android TWA wrapper with quick‑start steps and output path info.",
  "frontend/docs/ANDROID_AAB.md": "Detailed instructions for configuring, building, signing, verifying, and uploading the Android AAB.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "PWA‑enabled HTML entry point with manifest and icon references for the web app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, start URL, and icon assets.",
  "frontend/scripts/android/build-release-aab.sh": "Script that validates signing config, builds the release AAB, and copies it to a stable output directory.",
  "frontend/scripts/android/update-wrapper.sh": "Script that generates or updates the Bubblewrap TWA project using the config file.",
  "frontend/src/App.tsx": "Main React app wiring TanStack Router routes for home and order pages within a layout component.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header navigation, mobile menu sheet, footer, and renders nested routes via Outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Contains placeholder React Query hook demonstrating how to run backend queries using the actor.",
  "frontend/src/index.css": "Sets global Tailwind styles, fonts, CSS variables, and light/dark theme tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then mounts App.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero, feature highlights, and a gallery of artworks with modal preview support.",
  "frontend/src/pages/OrderPage.tsx": "Implements an order form that collects customer details and sends them via WhatsApp upon submission.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata and feature list for a two‑page static art website and its Android app packaging plan."
}